Конфигурация/Documents/ВыводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВыводДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
				<xr:Item>Document.ПоручениеНаДвижениеЦенныхБумаг</xr:Item>
				<xr:Item>Document.ПогашениеПаев</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваПереданныеВОплатуПаев</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаличные</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеПаев</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДФЛ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыпискиНДФЛ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДоговорТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПогашениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПогашениеПаев</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДолиПайщиковВИнвестиционномФонде</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПайщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПайщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПогашенияПаев</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПогашенияПаев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Партии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗачислениеПаев</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗачислениеПаев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПаев</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПокупки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПогашения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВладения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ВыводДенежныхСредств/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЭтоВыводПоОбменуПаев = ТипЗнч(Данные.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Основание, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен;
			
	Если Данные.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику Тогда
		Представление = "Вывод д/с при погашении паев ";
	ИначеЕсли ЭтоВыводПоОбменуПаев Тогда
		Представление = "Вывод д/с по обмену паев ";	
	Иначе
		Представление = "Вывод денежных средств ";
	КонецЕсли;

	Представление = Представление + СокрЛП(Данные.Номер) + " от " + Данные.Дата;
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ВидОперации");
	Поля.Добавить("Основание");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Функция ПолучитьДанныеЗаполненияПоЗаявкеПайщика(Основание, МоментВремени) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.Организация КАК Организация,
	|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Основание,
	|	ВЫБОР КОГДА ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОбороты.Основание) = ТИП(Документ.ЗаявкаПайщика)
	|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.ЗаявкаПайщика).ВидЗаявки
	|				ИНАЧЕ ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.ПогашениеПаев).Заявка.ВидЗаявки
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Погашение) ТОГДА	
	|	ЗадолженностиПоДенежнымСредствамОбороты.Контрагент  ИНАЧЕ &ЮрЛицоОрганизации КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОбороты.Основание) = ТИП(Документ.ЗаявкаПайщика)
	|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.ЗаявкаПайщика).РасчетныйСчет
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОбороты.Основание) = ТИП(Документ.ПогашениеПаев)
	|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.ПогашениеПаев).Заявка.РасчетныйСчет
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК РасчетныйСчетКонтрагента,
	|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаОборот КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
	|				И ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОбороты.Основание) = ТИП(Документ.ЗаявкаПайщика)
	|						ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.ЗаявкаПайщика).ВидЗаявки
	|					ИНАЧЕ ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.ПогашениеПаев).Заявка.ВидЗаявки
	|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Погашение)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОжидаетсяНачислениеНДФЛ
	|ПОМЕСТИТЬ _Задолженность
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			,
	|			&КонецПериодаГраница,
	|			,
	|			Организация = &Организация
	|				И ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(&Основание) = ТИП(Документ.ЗаявкаПайщика)
	|						ТОГДА Основание.Заявка = &Основание
	|					ИНАЧЕ Основание = &Основание
	|				КОНЕЦ
	|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПередПайщиками)
	|				И НЕ Аванс) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачисленияНалоговОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	НачисленияНалоговОбороты.Налогоплательщик КАК Налогоплательщик,
	|	НачисленияНалоговОбороты.СуммаОборот КАК СуммаНДФЛ,
	|	НачисленияНалоговОбороты.БазаНалогаОборот КАК БазаНалога,
	|	РасчетНДФЛПайщиковНалоговаяБаза.Основание КАК ПогашениеПаев,
	|	НачисленияНалоговОбороты.Основание КАК РасчетНДФЛПайщиков
	|ПОМЕСТИТЬ _НачислениеНалога
	|ИЗ
	|	РегистрНакопления.НачисленияНалогов.Обороты(
	|			,
	|			&КонецПериодаГраница,
	|			Регистратор,
	|			Организация = &Организация
	|				И Налогоплательщик = &Пайщик
	|				И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.РасчетНДФЛПайщиков)) КАК НачисленияНалоговОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетНДФЛПайщиков.НалоговаяБаза КАК РасчетНДФЛПайщиковНалоговаяБаза
	|		ПО НачисленияНалоговОбороты.Основание = РасчетНДФЛПайщиковНалоговаяБаза.Ссылка
	|			И НачисленияНалоговОбороты.Налогоплательщик = РасчетНДФЛПайщиковНалоговаяБаза.Пайщик
	|			И (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(&Основание) = ТИП(Документ.ЗаявкаПайщика)
	|					ТОГДА ВЫРАЗИТЬ(РасчетНДФЛПайщиковНалоговаяБаза.Основание КАК Документ.ПогашениеПаев).Заявка = &Основание
	|				ИНАЧЕ РасчетНДФЛПайщиковНалоговаяБаза.Основание = &Основание
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИсполнителиПоДенежнымСредствамСобственные.Организация КАК Организация,
	|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет КАК РасчетныйСчет
	|ПОМЕСТИТЬ _РасчетныйСчет
	|ИЗ
	|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
	|ГДЕ
	|	(ИсполнителиПоДенежнымСредствамСобственные.Организация, ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				_Задолженность.Организация КАК Организация,
	|				_Задолженность.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|			ИЗ
	|				_Задолженность КАК _Задолженность)
	|	И НЕ ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Транзитный
	|	И НЕ ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.ТранзитныйПИФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Задолженность.Организация КАК Организация,
	|	_Задолженность.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_Задолженность.Основание КАК Основание,
	|	_Задолженность.Контрагент КАК Контрагент,
	|	_Задолженность.РасчетныйСчетКонтрагента КАК РасчетныйСчетКонтрагента,
	|	_Задолженность.Сумма + ЕСТЬNULL(_НачислениеНалога.СуммаНДФЛ, 0) КАК Сумма,
	|	_РасчетныйСчет.РасчетныйСчет КАК РасчетныйСчет,
	|	ЕСТЬNULL(_НачислениеНалога.СуммаНДФЛ, 0) КАК СуммаНДФЛ,
	|	_Задолженность.ОжидаетсяНачислениеНДФЛ КАК ОжидаетсяРасчетНДФЛ,
	|	ВЫБОР
	|		КОГДА _НачислениеНалога.РасчетНДФЛПайщиков ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьРасчетНДФЛ
	|ИЗ
	|	_Задолженность КАК _Задолженность
	|		ЛЕВОЕ СОЕДИНЕНИЕ _РасчетныйСчет КАК _РасчетныйСчет
	|		ПО _Задолженность.Организация = _РасчетныйСчет.Организация
	|			И _Задолженность.СчетДоверительногоУправления = _РасчетныйСчет.СчетДоверительногоУправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ _НачислениеНалога КАК _НачислениеНалога
	|		ПО _Задолженность.Контрагент = _НачислениеНалога.Налогоплательщик
	|			И _Задолженность.Основание = _НачислениеНалога.ПогашениеПаев";
	
	Запрос.УстановитьПараметр("Основание",				Основание);
	Запрос.УстановитьПараметр("Организация",			Основание.Организация);
	Запрос.УстановитьПараметр("ЮрЛицоОрганизации",		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("Пайщик",					Основание.Пайщик);
	Запрос.УстановитьПараметр("КонецПериодаГраница",	Новый Граница(МоментВремени, ВидГраницы.Исключая));
	
	Данные = Запрос.Выполнить().Выгрузить(); 
	Результат = Новый Структура();
	
	Для Каждого СтрокаДанные Из Данные Цикл
		Результат = РаботаСКоллекциями.ТаблицаЗначений_СтрокаВСтруктуру(СтрокаДанные);
		Возврат Результат;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
